# Bundler for non-Ruby dependencies from Homebrew, Homebrew Cask, Mac App Store, Whalebrew and Visual Studio Code.
tap "homebrew/bundle"
# Command-line tool for upgrading every outdated app installed by Homebrew Cask
tap "buo/cask-upgrade"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Distributed revision control system
brew "git"
# Tool to build, change, and version infrastructure
brew "hashicorp/tap/terraform"
# Kubernetes package manager
brew "helm"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Extremely fast Python linter, written in Rust
brew "ruff"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Linter for YAML files
brew "yamllint"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Free and Open Source messaging and emailing app
cask "rambox"
# Password manager that keeps all passwords secure behind one password
cask "1Password"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Web browser
cask "google-chrome"
# Open-source code editor
cask "visual-studio-code"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# App to build and share containerised applications and microservices
cask "docker"
# Trains AIs to understand and translate texts
cask "deepl"
# Music streaming service
cask "spotify"
# Collaboration platform for API development
cask "postman"
# App to write, plan, collaborate, and get organised
cask "notion"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# Optimise your webcam, headset, and Logi Dock for video meetings
cask "logitune"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Improve your code commenting by annotating with alert, informational, TODOs, and more!
vscode "aaron-bond.better-comments"
# Syntax highlighting for jinja(2) including HTML, Markdown, YAML, Ruby and LaTeX templates
vscode "samuelcolvin.jinjahtml"
# Copy breadcrumbs
vscode "scott-blair.copy-breadcrumbs"
# Open any folder or repository inside a Docker container and take advantage of Visual Studio Code's full feature set.
vscode "ms-vscode-remote.remote-containers"
# Translate the code into diagrams
vscode "tehpeng.diagramspreviewer"
# Makes it easy to create, manage, and debug containerized applications.
vscode "ms-azuretools.vscode-docker"
# Gemini Code Assist + Tools for Google Cloud
vscode "googlecloudtools.cloudcode"
# GitHub Actions workflows and runs for github.com hosted repositories in VS Code
vscode "github.vscode-github-actions"
# Supercharge Git within VS Code
vscode "eamodio.gitlens"
# HashiCorp HCL syntax
vscode "hashicorp.hcl"
# Syntax highlighting and autocompletion for Terraform
vscode "hashicorp.terraform"
# Jupyter notebook support, interactive programming and computing that supports Intellisense, debugging and more.
vscode "ms-toolsai.jupyter"
# Develop, deploy and debug Kubernetes applications
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
# All you need to write Markdown (keyboard shortcuts, table of contents, auto preview and more)
vscode "yzhang.markdown-all-in-one"
# Views Apache Parquet files as JSON
vscode "dvirtz.parquet-viewer"
# a.k.a. dbt™ power user makes vscode seamlessly work with dbt™
vscode "innoverio.vscode-dbt-power-user"
# Visual Studio Code Prettify JSON Extension
vscode "mohsen1.prettify-json"
# Python language support
vscode "ms-python.python"
# Highlight CSV and TSV files, Run SQL-like queries
vscode "mechatroner.rainbow-csv"
# A Visual Studio Code extension with support for the Ruff linter.
vscode "charliermarsh.ruff"
# A linter and auto-formatter for SQLfluff, a popular linting tool for SQL and dbt.
vscode "dorzey.vscode-sqlfluff"
# VSCode Snippet Package for jinja and dbt
vscode "bastienboutonnet.vscode-dbt"
# Icons for Visual Studio Code
vscode "vscode-icons-team.vscode-icons"
# Get and Set cursor position by byte offset
vscode "jtr.vscode-position"
# XML Language Support by Red Hat
vscode "redhat.vscode-xml"
# YAML Language Support by Red Hat, with built-in Kubernetes syntax support
vscode "redhat.vscode-yaml"